<template>
  <div id="home">
    <div>
      <a href="javascript:;" @click="showToast">toast</a>
    </div>
    <div>
      <a href="javascript:;" @click="showAlert">alert</a>
    </div>
  </div>
</template>

<script>
  export default {
    name: 'home',
    mounted() {
    },
    methods: {
      showToast() {
        // this.$toast("加载中");
        /*this.$toast({
          type: "loading",
        });*/
        /*this.$toast({
          type: "success",
          text: "加载成功",
        });*/
        /*this.$toast({
          type: "fail",
          text: "加载失败",
        });*/
        let toast = this.$toast({
          type: "loading"
        });
        setTimeout(() => {
          toast.close();
        }, 500);
      },
      showAlert() {
        // this.$alert("内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容");
        this.$alert({
          title: '警告',
          text: "内容内容内容内容内容内容内容内容内容内容内容内容",
          okText: '我知道了',
          callback: () => {
            console.log('点击了确定');
          }
        });
        /*let ale = this.$alert({
          title:'警告',
          text:"内容内容内容内容内容内容内容内容内容内容内容内容",
        });
        setTimeout(() => {
          ale.close();
        }, 500);*/
      }
    }
  }
</script>

<style scoped>
</style>
